#Использовать json
#Использовать logos

Перем ФайлJSON Экспорт;
Перем Существует Экспорт;
Перем ЭтоФорматJSON Экспорт;
Перем Прочитан Экспорт;
Перем ТекстФайла Экспорт;
Перем ПараметрыJSON Экспорт;
Перем Лог;

Процедура ПриСозданииОбъекта(ПутьФайла = "", Кодировка = Неопределено)
	
		Лог = Логирование.ПолучитьЛог(Инициализация.ИмяЛога());
		Лог.Отладка("Создание объекта ОбработкаJSON");
		Лог.Отладка("Путь файла: " + Строка(ПутьФайла));
		Лог.Отладка("Кодировка: " + Строка(Кодировка));

		// Если передан файл json то сразу читаем его	
		ПрочитатьТекстФайла(ПутьФайла, Кодировка);

КонецПроцедуры

Процедура ПрочитатьПараметрыJSON() Экспорт

	Если ПустаяСтрока(ТекстФайла) Тогда
		Лог.Отладка("Текст файла пустой. ЧтениеJSON отменено");
		Возврат;
	КонецЕсли;

	Лог.Отладка("Начато ЧтениеJSON");
	ЧтениеJSON = Новый ПарсерJSON();
	ПараметрыJSON = ЧтениеJSON.ПрочитатьJSON(ТекстФайла);

КонецПроцедуры	

Процедура ПрочитатьТекстФайла(ПутьФайла = "", Кодировка = Неопределено) Экспорт

	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
		Лог.Отладка("Установлена кодировка по умолчанию: " + Строка(Кодировка));
	КонецЕсли;	
	
	Если ПустаяСтрока(ПутьФайла) Тогда
		Если Не(ЗначениеЗаполнено(ФайлJSON)) Тогда // Если файл уже есть, то читаем его
			Лог.Отладка("Путь файла пустой и ФайлJSON не заполнен. Чтение отмененно.");
			Возврат;
		ИначеЕсли ТипЗнч(ФайлJSON) <> Тип("Файл") Тогда // мало ли что могут передать...
			Лог.Отладка("Путь файла пустой и ФайлJSON не является файлом. Чтение отмененно.");
			Возврат;	
		КонецЕсли;	
	Иначе // Если передан путь, то заново инициализируем файл
		ФайлJSON = Новый Файл(ПутьФайла);
	КонецЕсли;

	Если ФайлJSON.Существует() Тогда
		Существует = Истина;
		Лог.Отладка("ФайлJSON существует");
	Иначе
		Существует = Ложь;
		Лог.Отладка("ФайлJSON не существует. Чтение отменено.");
		Возврат;
	КонецЕсли;

	// Чтение файла
	Если ФайлJSON.ЭтоФайл()
		И (ФайлJSON.Расширение = ".json" ИЛИ ФайлJSON.Расширение = "json") Тогда
		
		Лог.Отладка("Начато чтение ФайлаJSON");
		ЧтениеТекста = Новый ЧтениеТекста(ПутьФайла, Кодировка);
		ТекстФайла = ЧтениеТекста.Прочитать();
		Лог.Отладка("Текст файла: " + Строка(ТекстФайла));
		ЧтениеТекста.Закрыть();

	КонецЕсли;

	// Проверка чтения 
	Если Не(ПустаяСтрока(ТекстФайла)) Тогда
		Прочитан = Истина;
	КонецЕсли;	

КонецПроцедуры

ФайлJSON = Неопределено; // Объект типа "файл"
Существует = Ложь; 
ЭтоФорматJSON = Ложь;
Прочитан = Ложь;
ТекстФайла = "";
ПараметрыJSON = Неопределено;
	