// Подключение самописных логов
#Использовать "." 

// Работа с графическим интерфейсом
//#Использовать os_gui 

// Логирование
#Использовать logos

Перем Форма;
Перем Лог;
Перем ПараметрыРаботы;

Лог = Логирование.ПолучитьЛог(Инициализация.ИмяЛога());
ПараметрыРаботы = Новый ПараметрыРаботы();
ПараметрыРаботы.Инициализация(АргументыКоманднойСтроки, Лог);

// Проверка полученных параметров
Если ПараметрыРаботы.ПараметрыСоединений = Неопределено Тогда
	Лог.КритическаяОшибка("Параметры соединения не заданы");
	ЗавершитьРаботу(1);
ИначеЕсли ПараметрыРаботы.ПараметрыКоманд = Неопределено Тогда
	Лог.КритическаяОшибка("Параметры команд не заданы");
	ЗавершитьРаботу(2);
ИначеЕсли ПараметрыРаботы.ПараметрыОбщие.РежимТестирования Тогда
	Лог.Информация("Завершение работы режима тестирования параметров");
	ЗавершитьРаботу(3);	
КонецЕсли;	

Лог.Отладка("Проверка параметров выполнена успешно");

// Инициализация переменных
ПервоочередныеКоманды = Неопределено;
ПараметрыОбщие = ПараметрыРаботы.ПараметрыОбщие;
ПараметрыСоединений = ПараметрыРаботы.ПараметрыСоединений;
ПараметрыКоманд = ПараметрыРаботы.ПараметрыКоманд;

Если ОбработкаКоманд.ЕстьДочерниеПараметрыКоманд(ПараметрыКоманд, ПервоочередныеКоманды, "") Тогда


Иначе
	Лог.КритичнаяОшибка("Не найдено первоочередных команд.");
	ЗавершитьРаботу(4);
КонецЕсли	

