
// ИНИЦИАЛИЗАЦИОННЫЕ
// Возвращает имя лога в зависимости от выполняемой операции
Функция ИмяЛога() Экспорт
	Возврат "DataBaseManager.app.main";
КонецФункции	

// Здесь можно переопределить маски файлов, которые используются для поиска
Функция ПолучитьМаскиПоискаФайлов() Экспорт

	МаскиПоискаФайлов = Новый Соответствие();
	МаскиПоискаФайлов.Вставить("ПараметрыСоединений", "DBM_con*.json");
	МаскиПоискаФайлов.Вставить("ПараметрыКоманд", "DBM_ex*.json");
	Возврат МаскиПоискаФайлов;

КонецФункции

// К ключам привязаны определенные методы, а значение проверяется на равенство типу команды. 
// Если Значение равно типу команды, то выполняется метод привязанный к данному ключу. 
// Менять стоит именно значения, так как ключи привязаны в коде.
Функция ПолучитьСвязиИдентификаторовМетодовОбработкиКоманд() Экспорт

	СвязиИдентификаторов = Новый Соответствие();
	СвязиИдентификаторов.Вставить("РезервноеКопирование", "РезервноеКопирование");
	СвязиИдентификаторов.Вставить("ВосстановлениеБазы", "ВосстановлениеБазы");
	Возврат СвязиИдентификаторов;

КонецФункции	

// СЛУЖЕБНЫЕ
Функция ПолучитьМаскуПоискаФайлов(ИдентификаторПараметров) Экспорт
	
		МаскиПоискаФайлов = ПолучитьМаскиПоискаФайлов();
		Возврат МаскиПоискаФайлов.Получить(ИдентификаторПараметров);
	
	КонецФункции