
// Добавляет элементы массива источника к элементам массива приемника
Процедура ОбъединитьМассивы(МассивПриемник, МассивИсточник) Экспорт
	
		Массив1 = МассивПриемник;
		Массив2 = МассивИсточник;
	
		Если Массив1.Количество() > Массив2.Количество() Тогда
			МассивИсточник = Массив2;
			МассивПриемник = Массив1;
		Иначе
			МассивИсточник = Массив1;
			МассивПриемник = Массив2;
		КонецЕсли;	
	
		Для Каждого ЭлементИсточника Из МассивИсточник Цикл
			МассивПриемник.Добавить(ЭлементИсточника);
		КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруСвойств(СтруктураСвойств, Источник)
	
	Для Каждого КлючИЗначение Из СтруктураСвойств Цикл
		СтруктураСвойств.Вставить(КлючИЗначение.Ключ, Источник.Получить(КлючИЗначение.Ключ));
	КонецЦикла;	

КонецПроцедуры